[Killed] Boolean mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Card.cs:10:62
 
         public bool FaceUp { get; private set; }
 
-        public Card(Suit suit, Rank rank) : this(suit, rank, true)
+        public Card(Suit suit, Rank rank) : this(suit, rank, false)
         {
         }

[Killed] Block removal mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Card.cs:15:9
         }
 
         public Card(Suit suit, Rank rank, bool faceUp)
-        {
-            Suit = suit;
-            Rank = rank;
-            FaceUp = faceUp;
-        }
+        {}
 
         public int Value => Rank.GetValue();

[Killed] Negate expression
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Card.cs:25:20
 
         public override string ToString()
         {
-            return FaceUp ? $"{Suit.ToCharacter()} {Rank} of {Suit}" : "## Face Down ##";
+            return !(FaceUp ) ? $"{Suit.ToCharacter()} {Rank} of {Suit}" : "## Face Down ##";
         }
         public string GetAsciiArt()

[Killed] String mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Card.cs:25:29
 
         public override string ToString()
         {
-            return FaceUp ? $"{Suit.ToCharacter()} {Rank} of {Suit}" : "## Face Down ##";
+            return FaceUp ? $"" : "## Face Down ##";
         }
         public string GetAsciiArt()

[NoCoverage] Negate expression
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Card.cs:29:17
         }
         public string GetAsciiArt()
         {
-            if (FaceUp)
+            if (!(FaceUp))
             {
                 return $@"

[NoCoverage] String mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Card.cs:31:24
         {
             if (FaceUp)
             {
-                return $@"
-┌─────────┐
-│ {Rank.ToShortString(),-2}      │
-│         │
-│    {Suit.ToCharacter(),-2}   │
-│         │
-│      {Rank.ToShortString(),2} │
-└─────────┘";
+                return $"";
             }
             else

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Card.cs:55:22
 
         public virtual void Flip()
         {
-            FaceUp = !FaceUp;
+            FaceUp = FaceUp;
         }
     }
