[Survived] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:16:13
             Player = new Player(name);
             Dealer = new Dealer();
             Shoe = new Shoe();
-            Shoe.Shuffle();
+            ;
         }
 

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:21:13
 
         public void DealCards()
         {
-            Player.PrimaryHand.AddCard(new Card(Suit.Hearts, Rank.Queen));
+            ;
             //Player.PrimaryHand.AddCard(Shoe.DrawCard());
             Dealer.PrimaryHand.AddCard(Shoe.DrawCard());

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:23:13
         {
             Player.PrimaryHand.AddCard(new Card(Suit.Hearts, Rank.Queen));
             //Player.PrimaryHand.AddCard(Shoe.DrawCard());
-            Dealer.PrimaryHand.AddCard(Shoe.DrawCard());
+            ;
 
             Player.PrimaryHand.AddCard(new Card(Suit.Hearts, Rank.King));

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:25:13
             //Player.PrimaryHand.AddCard(Shoe.DrawCard());
             Dealer.PrimaryHand.AddCard(Shoe.DrawCard());
 
-            Player.PrimaryHand.AddCard(new Card(Suit.Hearts, Rank.King));
+            ;
             //Player.PrimaryHand.AddCard(Shoe.DrawCard());
             Dealer.PrimaryHand.AddCard(Shoe.DrawCard(true));

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:27:13
 
             Player.PrimaryHand.AddCard(new Card(Suit.Hearts, Rank.King));
             //Player.PrimaryHand.AddCard(Shoe.DrawCard());
-            Dealer.PrimaryHand.AddCard(Shoe.DrawCard(true));
+            ;
         }
 

[Killed] Boolean mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:27:54
 
             Player.PrimaryHand.AddCard(new Card(Suit.Hearts, Rank.King));
             //Player.PrimaryHand.AddCard(Shoe.DrawCard());
-            Dealer.PrimaryHand.AddCard(Shoe.DrawCard(true));
+            Dealer.PrimaryHand.AddCard(Shoe.DrawCard(false));
         }
 

[NoCoverage] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:32:13
 
         public void DealCardsBlackJack() // for demo
         {
-            Player.PrimaryHand.AddCard(new Card(Suit.Hearts, Rank.Ace));
+            ;
 
             Dealer.PrimaryHand.AddCard(Shoe.DrawCard());

[NoCoverage] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:34:13
         {
             Player.PrimaryHand.AddCard(new Card(Suit.Hearts, Rank.Ace));
 
-            Dealer.PrimaryHand.AddCard(Shoe.DrawCard());
+            ;
 
             Player.PrimaryHand.AddCard(new Card(Suit.Hearts, Rank.King));

[NoCoverage] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:38:13
 
             Player.PrimaryHand.AddCard(new Card(Suit.Hearts, Rank.King));
 
-            Dealer.PrimaryHand.AddCard(Shoe.DrawCard(true));
+            ;
         }
 

[NoCoverage] Boolean mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:38:54
 
             Player.PrimaryHand.AddCard(new Card(Suit.Hearts, Rank.King));
 
-            Dealer.PrimaryHand.AddCard(Shoe.DrawCard(true));
+            Dealer.PrimaryHand.AddCard(Shoe.DrawCard(false));
         }
 

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:56:17
         {
             foreach (PlayerHand hand in Player.Hands)
             {
-                DecideWinnerForHand(hand);
+                ;
             }
         }

[Killed] Negate expression
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:62:17
 
         private void DecideWinnerForHand(PlayerHand hand)
         {
-            if (hand.IsCharlie)
+            if (!(hand.IsCharlie))
             {
                 Player.AddWinnings(hand);

[Survived] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:64:17
         {
             if (hand.IsCharlie)
             {
-                Player.AddWinnings(hand);
+                ;
                 hand.SetGameResult(GameResult.Win);
             }

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:65:17
             if (hand.IsCharlie)
             {
                 Player.AddWinnings(hand);
-                hand.SetGameResult(GameResult.Win);
+                ;
             }
             else if (hand.IsBust)

[Killed] Negate expression
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:67:22
                 Player.AddWinnings(hand);
                 hand.SetGameResult(GameResult.Win);
             }
-            else if (hand.IsBust)
+            else if (!(hand.IsBust))
             {
                 hand.SetGameResult(GameResult.Lose);

[NoCoverage] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:69:17
             }
             else if (hand.IsBust)
             {
-                hand.SetGameResult(GameResult.Lose);
+                ;
             }
             else if (Dealer.PrimaryHand.IsBust)

[Killed] Negate expression
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:71:22
             {
                 hand.SetGameResult(GameResult.Lose);
             }
-            else if (Dealer.PrimaryHand.IsBust)
+            else if (!(Dealer.PrimaryHand.IsBust))
             {
                 Player.AddWinnings(hand);

[Killed] Negate expression
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:76:22
                 Player.AddWinnings(hand);
                 hand.SetGameResult(GameResult.Win);
             }
-            else if (hand.IsBlackJack && !Dealer.PrimaryHand.IsBlackJack)
+            else if (!(hand.IsBlackJack && !Dealer.PrimaryHand.IsBlackJack))
             {
                 Player.AddWinningsBlackJack(hand);

[Killed] Logical mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:76:22
                 Player.AddWinnings(hand);
                 hand.SetGameResult(GameResult.Win);
             }
-            else if (hand.IsBlackJack && !Dealer.PrimaryHand.IsBlackJack)
+            else if (hand.IsBlackJack || !Dealer.PrimaryHand.IsBlackJack)
             {
                 Player.AddWinningsBlackJack(hand);

[Survived] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:78:17
             }
             else if (hand.IsBlackJack && !Dealer.PrimaryHand.IsBlackJack)
             {
-                Player.AddWinningsBlackJack(hand);
+                ;
                 hand.SetGameResult(GameResult.Win);
             }

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:79:17
             else if (hand.IsBlackJack && !Dealer.PrimaryHand.IsBlackJack)
             {
                 Player.AddWinningsBlackJack(hand);
-                hand.SetGameResult(GameResult.Win);
+                ;
             }
             else if (hand.TotalValue == Dealer.PrimaryHand.TotalValue)

[Killed] Equality mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:81:22
                 Player.AddWinningsBlackJack(hand);
                 hand.SetGameResult(GameResult.Win);
             }
-            else if (hand.TotalValue == Dealer.PrimaryHand.TotalValue)
+            else if (hand.TotalValue != Dealer.PrimaryHand.TotalValue)
             {
                 Player.AddWinningsPush(hand);

[Survived] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:83:17
             }
             else if (hand.TotalValue == Dealer.PrimaryHand.TotalValue)
             {
-                Player.AddWinningsPush(hand);
+                ;
                 hand.SetGameResult(GameResult.Push);
             }

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:84:17
             else if (hand.TotalValue == Dealer.PrimaryHand.TotalValue)
             {
                 Player.AddWinningsPush(hand);
-                hand.SetGameResult(GameResult.Push);
+                ;
             }
             else if (hand.TotalValue > Dealer.PrimaryHand.TotalValue)

[Killed] Negate expression
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:86:22
                 Player.AddWinningsPush(hand);
                 hand.SetGameResult(GameResult.Push);
             }
-            else if (hand.TotalValue > Dealer.PrimaryHand.TotalValue)
+            else if (!(hand.TotalValue > Dealer.PrimaryHand.TotalValue))
             {
                 Player.AddWinnings(hand);

[Killed] Equality mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:86:22
                 Player.AddWinningsPush(hand);
                 hand.SetGameResult(GameResult.Push);
             }
-            else if (hand.TotalValue > Dealer.PrimaryHand.TotalValue)
+            else if (hand.TotalValue < Dealer.PrimaryHand.TotalValue)
             {
                 Player.AddWinnings(hand);

[Killed] Negate expression
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:91:22
                 Player.AddWinnings(hand);
                 hand.SetGameResult(GameResult.Win);
             }
-            else if (hand.TotalValue < Dealer.PrimaryHand.TotalValue)
+            else if (!(hand.TotalValue < Dealer.PrimaryHand.TotalValue))
             {
                 hand.SetGameResult(GameResult.Lose);

[Killed] Equality mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:91:22
                 Player.AddWinnings(hand);
                 hand.SetGameResult(GameResult.Win);
             }
-            else if (hand.TotalValue < Dealer.PrimaryHand.TotalValue)
+            else if (hand.TotalValue > Dealer.PrimaryHand.TotalValue)
             {
                 hand.SetGameResult(GameResult.Lose);

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:99:13
 
         public void PlayerDoubleDown(PlayerHand hand)
         {
-            Player.PlaceBet(hand.Bet, hand);
+            ;
             PlayerHit(hand);
             PlayerStand(hand);

[Survived] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:100:13
         public void PlayerDoubleDown(PlayerHand hand)
         {
             Player.PlaceBet(hand.Bet, hand);
-            PlayerHit(hand);
+            ;
             PlayerStand(hand);
         }

[Survived] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:101:13
         {
             Player.PlaceBet(hand.Bet, hand);
             PlayerHit(hand);
-            PlayerStand(hand);
+            ;
         }
 

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:106:13
 
         public void PlayerHit(HandBase hand)
         {
-            hand.AddCard(Shoe.DrawCard());
+            ;
         }
 

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:111:13
 
         public void PlayerPlaceBet(decimal bet)
         {
-            Player.PlaceBet(bet);
+            ;
         }
 

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:116:13
 
         public void PlayerSplit(PlayerHand splittingHand)
         {
-            Player.SplitPair(splittingHand);
+            ;
             foreach (HandBase hand in Player.Hands)
             {

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:119:17
             Player.SplitPair(splittingHand);
             foreach (HandBase hand in Player.Hands)
             {
-                PlayerHit(hand);
+                ;
             }
         }

[Survived] Boolean mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:125:27
 
         public void PlayerStand(PlayerHand hand)
         {
-            hand.Stands = true;
+            hand.Stands = false;
             Dealer.Stand(Shoe);
         }

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:126:13
         public void PlayerStand(PlayerHand hand)
         {
             hand.Stands = true;
-            Dealer.Stand(Shoe);
+            ;
         }
 

[Survived] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:131:13
 
         public void RestartGame()
         {
-            Player.ClearHands();
+            ;
             Dealer.ClearHands();
             if (Shoe.MarkerReached)

[Survived] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:132:13
         public void RestartGame()
         {
             Player.ClearHands();
-            Dealer.ClearHands();
+            ;
             if (Shoe.MarkerReached)
             {

[Survived] Negate expression
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Game.cs:133:17
         {
             Player.ClearHands();
             Dealer.ClearHands();
-            if (Shoe.MarkerReached)
+            if (!(Shoe.MarkerReached))
             {
                 Shoe = new Shoe();
