[NoCoverage] String mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/GameResult.cs:24:32
             GameResult.None => "No Contest",
             GameResult.Win => "You've won!",
             GameResult.Lose => "You've lost!",
-            GameResult.Push => "You've push!",
+            GameResult.Push => "",
             _ => throw new NotImplementedException(),
         };
