[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/DealerHand.cs:13:51
     {
         public void ShowAllCards()
         {
-            foreach (var card in Cards.Where(c => !c.FaceUp))
+            foreach (var card in Cards.Where(c => c.FaceUp))
             {
                 card.Flip();

[Killed] Statement mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/DealerHand.cs:15:17
         {
             foreach (var card in Cards.Where(c => !c.FaceUp))
             {
-                card.Flip();
+                ;
             }
         }
