[Killed] PostIncrementExpression to PostDecrementExpression mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/HandBase.cs:13:51
         {
             get
             {
-                for (int i = 0; i < _cards.Count; i++)
+                for (int i = 0; i < _cards.Count; i--)
                 {
                     yield return _cards[i];

[Killed] Equality mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/HandBase.cs:13:33
         {
             get
             {
-                for (int i = 0; i < _cards.Count; i++)
+                for (int i = 0; i <= _cards.Count; i++)
                 {
                     yield return _cards[i];

[Killed] Statement mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/HandBase.cs:15:21
             {
                 for (int i = 0; i < _cards.Count; i++)
                 {
-                    yield return _cards[i];
+                    ;
                 }
             }

[Killed] Equality mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/HandBase.cs:21:36
         }
 
         public GameResult GameResult { get; private set; } = GameResult.None;
-        public bool IsBlackJack => Cards.Count() == 2 && TotalValue == 21 && !IsSplit;
+        public bool IsBlackJack => Cards.Count() != 2 && TotalValue == 21 && !IsSplit;
         public bool IsBust => TotalValue > 21;
         public bool IsSplit { get; set; }

[Killed] Logical mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/HandBase.cs:21:36
         }
 
         public GameResult GameResult { get; private set; } = GameResult.None;
-        public bool IsBlackJack => Cards.Count() == 2 && TotalValue == 21 && !IsSplit;
+        public bool IsBlackJack => Cards.Count() == 2 && TotalValue == 21 || !IsSplit;
         public bool IsBust => TotalValue > 21;
         public bool IsSplit { get; set; }

[Killed] Equality mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/HandBase.cs:22:31
 
         public GameResult GameResult { get; private set; } = GameResult.None;
         public bool IsBlackJack => Cards.Count() == 2 && TotalValue == 21 && !IsSplit;
-        public bool IsBust => TotalValue > 21;
+        public bool IsBust => TotalValue < 21;
         public bool IsSplit { get; set; }
 

[Killed] Equality mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/HandBase.cs:22:31
 
         public GameResult GameResult { get; private set; } = GameResult.None;
         public bool IsBlackJack => Cards.Count() == 2 && TotalValue == 21 && !IsSplit;
-        public bool IsBust => TotalValue > 21;
+        public bool IsBust => TotalValue >= 21;
         public bool IsSplit { get; set; }
 

[Killed] Linq method mutation (Sum() to Max())
Blok1.BlackJack/Blok1.BlackJack/Hand/HandBase.cs:29:36
         {
             get
             {
-                int currentTotal = Cards.Sum(c => c.Rank.GetValue());
+                int currentTotal = Cards.Max(c => c.Rank.GetValue());
                 int countOfAces = Cards.Count(c => c.Rank == Rank.Ace);
 

[Killed] Equality mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/HandBase.cs:30:52
             get
             {
                 int currentTotal = Cards.Sum(c => c.Rank.GetValue());
-                int countOfAces = Cards.Count(c => c.Rank == Rank.Ace);
+                int countOfAces = Cards.Count(c => c.Rank != Rank.Ace);
 
                 for (int loop = countOfAces; loop > 0 && currentTotal > 21; loop--)

[Killed] Equality mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/HandBase.cs:32:46
                 int currentTotal = Cards.Sum(c => c.Rank.GetValue());
                 int countOfAces = Cards.Count(c => c.Rank == Rank.Ace);
 
-                for (int loop = countOfAces; loop > 0 && currentTotal > 21; loop--)
+                for (int loop = countOfAces; loop < 0 && currentTotal > 21; loop--)
                 {
                     currentTotal -= 10;

[Killed] Logical mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/HandBase.cs:32:46
                 int currentTotal = Cards.Sum(c => c.Rank.GetValue());
                 int countOfAces = Cards.Count(c => c.Rank == Rank.Ace);
 
-                for (int loop = countOfAces; loop > 0 && currentTotal > 21; loop--)
+                for (int loop = countOfAces; loop > 0 || currentTotal > 21; loop--)
                 {
                     currentTotal -= 10;

[Killed] SubtractAssignmentExpression to AddAssignmentExpression mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/HandBase.cs:34:21
 
                 for (int loop = countOfAces; loop > 0 && currentTotal > 21; loop--)
                 {
-                    currentTotal -= 10;
+                    currentTotal += 10;
                 }
 

[Killed] Block removal mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/HandBase.cs:42:9
         }
 
         public HandBase()
-        {
-            _cards = new List<Card>();
-            GameResult = GameResult.None;
-        }
+        {}
 
         public void AddCard(Card card)

[Killed] Statement mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/HandBase.cs:49:13
 
         public void AddCard(Card card)
         {
-            _cards.Add(card);
+            ;
         }
 

[Killed] Statement mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/HandBase.cs:54:13
 
         public void RemoveCard(Card card)
         {
-            _cards.Remove(card);
+            ;
         }
 

[Killed] Block removal mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/HandBase.cs:58:9
         }
 
         public void SetGameResult(GameResult result)
-        {
-            GameResult = result;
-        }
+        {}
 
         protected HandBase(bool isSplit) : this()

[NoCoverage] Block removal mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/HandBase.cs:63:9
         }
 
         protected HandBase(bool isSplit) : this()
-        {
-            IsSplit = isSplit;
-        }
+        {}
     }
 }
