[Killed] Equality mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/PlayerHand.cs:10:38
     {
         public decimal Bet { get; private set; }
 
-        public bool CanDoubleDown => Cards.Count() == 2;
+        public bool CanDoubleDown => Cards.Count() != 2;
 
         public bool CanSplit => Cards.Count() == 2 && Cards.First().Value == Cards.Skip(1).First().Value;

[Killed] Equality mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/PlayerHand.cs:12:55
 
         public bool CanDoubleDown => Cards.Count() == 2;
 
-        public bool CanSplit => Cards.Count() == 2 && Cards.First().Value == Cards.Skip(1).First().Value;
+        public bool CanSplit => Cards.Count() == 2 && Cards.First().Value != Cards.Skip(1).First().Value;
         public bool IsCharlie => Cards.Count() == 5 && !IsBust;
         public bool Stands { get; set; } = false;

[Killed] Equality mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/PlayerHand.cs:12:33
 
         public bool CanDoubleDown => Cards.Count() == 2;
 
-        public bool CanSplit => Cards.Count() == 2 && Cards.First().Value == Cards.Skip(1).First().Value;
+        public bool CanSplit => Cards.Count() != 2 && Cards.First().Value == Cards.Skip(1).First().Value;
         public bool IsCharlie => Cards.Count() == 5 && !IsBust;
         public bool Stands { get; set; } = false;

[Killed] Logical mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/PlayerHand.cs:13:34
         public bool CanDoubleDown => Cards.Count() == 2;
 
         public bool CanSplit => Cards.Count() == 2 && Cards.First().Value == Cards.Skip(1).First().Value;
-        public bool IsCharlie => Cards.Count() == 5 && !IsBust;
+        public bool IsCharlie => Cards.Count() == 5 || !IsBust;
         public bool Stands { get; set; } = false;
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/PlayerHand.cs:13:56
         public bool CanDoubleDown => Cards.Count() == 2;
 
         public bool CanSplit => Cards.Count() == 2 && Cards.First().Value == Cards.Skip(1).First().Value;
-        public bool IsCharlie => Cards.Count() == 5 && !IsBust;
+        public bool IsCharlie => Cards.Count() == 5 && IsBust;
         public bool Stands { get; set; } = false;
 

[Survived] Boolean mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/PlayerHand.cs:14:44
 
         public bool CanSplit => Cards.Count() == 2 && Cards.First().Value == Cards.Skip(1).First().Value;
         public bool IsCharlie => Cards.Count() == 5 && !IsBust;
-        public bool Stands { get; set; } = false;
+        public bool Stands { get; set; } = true;
 
         public PlayerHand(decimal bet = 0)

[Survived] Block removal mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/PlayerHand.cs:17:9
         public bool Stands { get; set; } = false;
 
         public PlayerHand(decimal bet = 0)
-        {
-            Bet = bet;
-        }
+        {}
 
         public PlayerHand(bool isSplit) : this()

[Killed] Block removal mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/PlayerHand.cs:22:9
         }
 
         public PlayerHand(bool isSplit) : this()
-        {
-            IsSplit = isSplit;
-        }
+        {}
 
         public void PlaceBet(decimal bet)

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/PlayerHand.cs:28:13
 
         public void PlaceBet(decimal bet)
         {
-            Bet += bet;
+            Bet -= bet;
         }
 

[NoCoverage] Equality mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/PlayerHand.cs:34:17
         public override string ToString()
         {
             string toString = String.Empty;
-            if (Bet > 0)
+            if (Bet >= 0)
             {
                 toString += $"Bet: {Bet}\n";

[NoCoverage] Equality mutation
Blok1.BlackJack/Blok1.BlackJack/Hand/PlayerHand.cs:34:17
         public override string ToString()
         {
             string toString = String.Empty;
-            if (Bet > 0)
+            if (Bet < 0)
             {
                 toString += $"Bet: {Bet}\n";
