[Survived] Block removal mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Dealer.cs:20:9
         }
 
         public override void ClearHands()
-        {
-            PrimaryHand = new DealerHand();
-        }
+        {}
 
         internal void Stand(Shoe shoe)

[Killed] Statement mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Dealer.cs:26:13
 
         internal void Stand(Shoe shoe)
         {
-            PrimaryHand.ShowAllCards();
+            ;
             while (PrimaryHand.TotalValue < 17)
             {

[Killed] Equality mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Dealer.cs:27:20
         internal void Stand(Shoe shoe)
         {
             PrimaryHand.ShowAllCards();
-            while (PrimaryHand.TotalValue < 17)
+            while (PrimaryHand.TotalValue > 17)
             {
                 PrimaryHand.AddCard(shoe.DrawCard());

[Killed] Negate expression
Blok1.BlackJack/Blok1.BlackJack/Player/Dealer.cs:27:20
         internal void Stand(Shoe shoe)
         {
             PrimaryHand.ShowAllCards();
-            while (PrimaryHand.TotalValue < 17)
+            while (!(PrimaryHand.TotalValue < 17))
             {
                 PrimaryHand.AddCard(shoe.DrawCard());

[Timeout] Statement mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Dealer.cs:29:17
             PrimaryHand.ShowAllCards();
             while (PrimaryHand.TotalValue < 17)
             {
-                PrimaryHand.AddCard(shoe.DrawCard());
+                ;
             }
         }
