[Killed] PostIncrementExpression to PostDecrementExpression mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:15:51
         {
             get
             {
-                for (int i = 0; i < _hands.Count; i++)
+                for (int i = 0; i < _hands.Count; i--)
                 {
                     yield return _hands[i];

[Killed] Equality mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:15:33
         {
             get
             {
-                for (int i = 0; i < _hands.Count; i++)
+                for (int i = 0; i <= _hands.Count; i++)
                 {
                     yield return _hands[i];

[Killed] Statement mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:17:21
             {
                 for (int i = 0; i < _hands.Count; i++)
                 {
-                    yield return _hands[i];
+                    ;
                 }
             }

[Survived] Linq method mutation (First() to FirstOrDefault())
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:22:42
             }
         }
 
-        public PlayerHand PrimaryHand => _hands.First();
+        public PlayerHand PrimaryHand => _hands.FirstOrDefault();
 
         public Player(string name, decimal balance = 20M)

[Killed] Statement mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:28:13
         {
             Name = name;
             Balance = balance;
-            _hands.Add(new());
+            ;
         }
 

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:35:13
 
         public void AddWinnings(PlayerHand hand)
         {
-            Balance += hand.Bet * 2;
+            Balance -= hand.Bet * 2;
         }
 

[Killed] Arithmetic mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:35:24
 
         public void AddWinnings(PlayerHand hand)
         {
-            Balance += hand.Bet * 2;
+            Balance += hand.Bet / 2;
         }
 

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:42:13
 
         public void AddWinningsBlackJack(PlayerHand hand)
         {
-            Balance += hand.Bet * 2.5M;
+            Balance -= hand.Bet * 2.5M;
         }
 

[Killed] Arithmetic mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:42:24
 
         public void AddWinningsBlackJack(PlayerHand hand)
         {
-            Balance += hand.Bet * 2.5M;
+            Balance += hand.Bet / 2.5M;
         }
 

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:49:13
 
         public void AddWinningsPush(PlayerHand hand)
         {
-            Balance += hand.Bet;
+            Balance -= hand.Bet;
         }
 

[Killed] Logical mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:62:20
 
         public bool GetCanDoubleDown(PlayerHand hand)
         {
-            return hand.CanDoubleDown && Balance > hand.Bet;
+            return hand.CanDoubleDown || Balance > hand.Bet;
         }
 

[Killed] Equality mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:62:42
 
         public bool GetCanDoubleDown(PlayerHand hand)
         {
-            return hand.CanDoubleDown && Balance > hand.Bet;
+            return hand.CanDoubleDown && Balance < hand.Bet;
         }
 

[Killed] Equality mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:67:37
 
         public bool GetCanSplit(PlayerHand hand)
         {
-            return hand.CanSplit && Balance > hand.Bet;
+            return hand.CanSplit && Balance < hand.Bet;
         }
 

[Killed] Logical mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:67:20
 
         public bool GetCanSplit(PlayerHand hand)
         {
-            return hand.CanSplit && Balance > hand.Bet;
+            return hand.CanSplit || Balance > hand.Bet;
         }
 

[Killed] Negate expression
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:74:17
 
         public void PlaceBet(decimal bet, PlayerHand hand)
         {
-            if (bet > Balance)
+            if (!(bet > Balance))
             {
                 throw new ArgumentOutOfRangeException("Not enough money");

[Killed] Equality mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:74:17
 
         public void PlaceBet(decimal bet, PlayerHand hand)
         {
-            if (bet > Balance)
+            if (bet < Balance)
             {
                 throw new ArgumentOutOfRangeException("Not enough money");

[Killed] Statement mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:76:17
         {
             if (bet > Balance)
             {
-                throw new ArgumentOutOfRangeException("Not enough money");
+                ;
             }
             Balance -= bet;

[Survived] String mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:76:55
         {
             if (bet > Balance)
             {
-                throw new ArgumentOutOfRangeException("Not enough money");
+                throw new ArgumentOutOfRangeException("");
             }
             Balance -= bet;

[Killed] SubtractAssignmentExpression to AddAssignmentExpression mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:78:13
             {
                 throw new ArgumentOutOfRangeException("Not enough money");
             }
-            Balance -= bet;
+            Balance += bet;
             hand.PlaceBet(bet);
         }

[Killed] Statement mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:79:13
                 throw new ArgumentOutOfRangeException("Not enough money");
             }
             Balance -= bet;
-            hand.PlaceBet(bet);
+            ;
         }
 

[Killed] Negate expression
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:86:17
 
         public void SplitPair(PlayerHand hand)
         {
-            if (hand.CanSplit)
+            if (!(hand.CanSplit))
             {
                 var secondHand = new PlayerHand(true);

[Killed] Boolean mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:88:49
         {
             if (hand.CanSplit)
             {
-                var secondHand = new PlayerHand(true);
+                var secondHand = new PlayerHand(false);
                 hand.IsSplit = true;
                 PlaceBet(hand.Bet, secondHand);

[Killed] Boolean mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:89:32
             if (hand.CanSplit)
             {
                 var secondHand = new PlayerHand(true);
-                hand.IsSplit = true;
+                hand.IsSplit = false;
                 PlaceBet(hand.Bet, secondHand);
                 secondHand.AddCard(hand.Cards.Skip(1).First());

[Survived] Statement mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:90:17
             {
                 var secondHand = new PlayerHand(true);
                 hand.IsSplit = true;
-                PlaceBet(hand.Bet, secondHand);
+                ;
                 secondHand.AddCard(hand.Cards.Skip(1).First());
                 hand.RemoveCard(hand.Cards.Skip(1).First());

[Killed] Statement mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:91:17
                 var secondHand = new PlayerHand(true);
                 hand.IsSplit = true;
                 PlaceBet(hand.Bet, secondHand);
-                secondHand.AddCard(hand.Cards.Skip(1).First());
+                ;
                 hand.RemoveCard(hand.Cards.Skip(1).First());
                 _hands.Add(secondHand);

[Survived] Linq method mutation (First() to FirstOrDefault())
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:91:36
                 var secondHand = new PlayerHand(true);
                 hand.IsSplit = true;
                 PlaceBet(hand.Bet, secondHand);
-                secondHand.AddCard(hand.Cards.Skip(1).First());
+                secondHand.AddCard(hand.Cards.Skip(1).FirstOrDefault());
                 hand.RemoveCard(hand.Cards.Skip(1).First());
                 _hands.Add(secondHand);

[Killed] Statement mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:92:17
                 hand.IsSplit = true;
                 PlaceBet(hand.Bet, secondHand);
                 secondHand.AddCard(hand.Cards.Skip(1).First());
-                hand.RemoveCard(hand.Cards.Skip(1).First());
+                ;
                 _hands.Add(secondHand);
             }

[Survived] Linq method mutation (First() to FirstOrDefault())
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:92:33
                 hand.IsSplit = true;
                 PlaceBet(hand.Bet, secondHand);
                 secondHand.AddCard(hand.Cards.Skip(1).First());
-                hand.RemoveCard(hand.Cards.Skip(1).First());
+                hand.RemoveCard(hand.Cards.Skip(1).FirstOrDefault());
                 _hands.Add(secondHand);
             }

[Killed] Statement mutation
Blok1.BlackJack/Blok1.BlackJack/Player/Player.cs:93:17
                 PlaceBet(hand.Bet, secondHand);
                 secondHand.AddCard(hand.Cards.Skip(1).First());
                 hand.RemoveCard(hand.Cards.Skip(1).First());
-                _hands.Add(secondHand);
+                ;
             }
         }
