[Survived] Block removal mutation
Blok1.BlackJack/Blok1.BlackJack/Player/PlayerBase.cs:11:9
         { }
 
         public PlayerBase(string name)
-        {
-            Name = name;
-        }
+        {}
 
         public abstract void ClearHands();
