[Killed] Equality mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Shoe.cs:13:33
         {
             get
             {
-                for (int i = 0; i < _cards.Count; i++)
+                for (int i = 0; i > _cards.Count; i++)
                 {
                     yield return _cards[i];

[Killed] Arithmetic mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Shoe.cs:20:55
             }
         }
 
-        public bool MarkerReached => _cards.Count <= (312 / 4);
+        public bool MarkerReached => _cards.Count <= (312 * 4);
 
         public Shoe()

[Killed] Equality mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Shoe.cs:20:38
             }
         }
 
-        public bool MarkerReached => _cards.Count <= (312 / 4);
+        public bool MarkerReached => _cards.Count > (312 / 4);
 
         public Shoe()

[Killed] Block removal mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Shoe.cs:23:9
         public bool MarkerReached => _cards.Count <= (312 / 4);
 
         public Shoe()
-        {
-            _cards = GetDecks();
-        }
+        {}
 
         public Card DrawCard(bool facedown = false)

[Survived] Linq method mutation (First() to FirstOrDefault())
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Shoe.cs:29:30
 
         public Card DrawCard(bool facedown = false)
         {
-            Card givenCard = Cards.First();
+            Card givenCard = Cards.FirstOrDefault();
             _cards.Remove(givenCard);
 

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Shoe.cs:30:13
         public Card DrawCard(bool facedown = false)
         {
             Card givenCard = Cards.First();
-            _cards.Remove(givenCard);
+            ;
 
             if (facedown)

[Killed] Negate expression
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Shoe.cs:32:17
             Card givenCard = Cards.First();
             _cards.Remove(givenCard);
 
-            if (facedown)
+            if (!(facedown))
             {
                 givenCard.Flip();

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Shoe.cs:34:17
 
             if (facedown)
             {
-                givenCard.Flip();
+                ;
             }
 

[Killed] Equality mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Shoe.cs:44:40
         {
             Random random = new();
 
-            for (int i = _cards.Count; i > 0; i--)
+            for (int i = _cards.Count; i < 0; i--)
             {
                 int randomIndex = random.Next(i);

[Killed] PostDecrementExpression to PostIncrementExpression mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Shoe.cs:44:47
         {
             Random random = new();
 
-            for (int i = _cards.Count; i > 0; i--)
+            for (int i = _cards.Count; i > 0; i++)
             {
                 int randomIndex = random.Next(i);

[Killed] Arithmetic mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Shoe.cs:47:37
             for (int i = _cards.Count; i > 0; i--)
             {
                 int randomIndex = random.Next(i);
-                int lastCardIndex = i - 1;
+                int lastCardIndex = i + 1;
                 SwitchCardPlaces(randomIndex, lastCardIndex);
             }

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Shoe.cs:48:17
             {
                 int randomIndex = random.Next(i);
                 int lastCardIndex = i - 1;
-                SwitchCardPlaces(randomIndex, lastCardIndex);
+                ;
             }
         }

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Shoe.cs:57:17
             var list = new List<Card>();
             foreach (var suit in Enum.GetValues<Suit>())
             {
-                list.AddRange(Enum.GetValues<Rank>().Select(rank => new Card(suit, rank)));
+                ;
             }
 

[Killed] Equality mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Shoe.cs:67:34
         {
             List<Card> fullShoe = new();
 
-            for (int passes = 1; passes <= countOfDecks; passes++)
+            for (int passes = 1; passes < countOfDecks; passes++)
             {
                 fullShoe.AddRange(GetDeck());

[Killed] Equality mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Shoe.cs:67:34
         {
             List<Card> fullShoe = new();
 
-            for (int passes = 1; passes <= countOfDecks; passes++)
+            for (int passes = 1; passes > countOfDecks; passes++)
             {
                 fullShoe.AddRange(GetDeck());

[Killed] Statement mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Shoe.cs:69:17
 
             for (int passes = 1; passes <= countOfDecks; passes++)
             {
-                fullShoe.AddRange(GetDeck());
+                ;
             }
             return fullShoe;

[Killed] Block removal mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Shoe.cs:75:9
         }
 
         private void SwitchCardPlaces(int randomIndex, int lastCardIndex)
-        {
-            Card shuffledCard = _cards[randomIndex];
-            _cards[randomIndex] = _cards[lastCardIndex];
-            _cards[lastCardIndex] = shuffledCard;
-        }
+        {}
     }
 }
