[Killed] String mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Suit.cs:18:32
             return suit switch
             {
                 Suit.Spades => "♠",
-                Suit.Hearts => "♥",
+                Suit.Hearts => "",
                 Suit.Diamonds => "♦",
                 Suit.Clubs => "♣",

[Killed] String mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Suit.cs:20:31
                 Suit.Spades => "♠",
                 Suit.Hearts => "♥",
                 Suit.Diamonds => "♦",
-                Suit.Clubs => "♣",
+                Suit.Clubs => "",
                 _ => "Unknown",
             };

[NoCoverage] String mutation
AnthonyEllenbroek/Blok1.BlackJack/Blok1.BlackJack/Suit.cs:21:22
                 Suit.Hearts => "♥",
                 Suit.Diamonds => "♦",
                 Suit.Clubs => "♣",
-                _ => "Unknown",
+                _ => "",
             };
         }
